---
kind: type
id: T:Autodesk.Revit.DB.Visual.CeramicApplicationType
source: html/ae641cce-13c4-72ef-937c-d30776d18ae2.htm
---
# Autodesk.Revit.DB.Visual.CeramicApplicationType

The enumerated type representing the permitted values for the asset property "CeramicApplication" from the "Ceramic" schema.

## Syntax (C#)
```csharp
public enum CeramicApplicationType
```